In [2]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['train.csv', 'gender_submission.csv', 'test.csv']

In [31]:
titanic_df = pd.read_csv("../input/train.csv")

In [32]:
titanic_df.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [33]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [34]:
titanic_df['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [15]:
titantic_df['Fare']

0        7.2500
1       71.2833
2        7.9250
3       53.1000
4        8.0500
5        8.4583
6       51.8625
7       21.0750
8       11.1333
9       30.0708
10      16.7000
11      26.5500
12       8.0500
13      31.2750
14       7.8542
15      16.0000
16      29.1250
17      13.0000
18      18.0000
19       7.2250
20      26.0000
21      13.0000
22       8.0292
23      35.5000
24      21.0750
25      31.3875
26       7.2250
27     263.0000
28       7.8792
29       7.8958
         ...
861     11.5000
862     25.9292
863     69.5500
864     13.0000
865     13.0000
866     13.8583
867     50.4958
868      9.5000
869     11.1333
870      7.8958
871     52.5542
872      5.0000
873      9.0000
874     24.0000
875      7.2250
876      9.8458
877      7.8958
878      7.8958
879     83.1583
880     26.0000
881      7.8958
882     10.5167
883     10.5000
884      7.0500
885     29.1250
886     13.0000
887     30.0000
888     23.4500
889     30.0000
890      7.7500
Name: Fare, Length: 891, dtype: float64

In [35]:
#891 rows and 12 columns
titanic_df.shape

(891, 12)

In [36]:
titanic_df[['Name', 'Age']].head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [39]:
titantic_df[['Name', 'Age', 'Sex', 'Survived']].head(25)

                                                 Name    ...     Survived
0                             Braund, Mr. Owen Harris    ...            0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...    ...            1
2                              Heikkinen, Miss. Laina    ...            1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)    ...            1
4                            Allen, Mr. William Henry    ...            0
5                                    Moran, Mr. James    ...            0
6                             McCarthy, Mr. Timothy J    ...            0
7                      Palsson, Master. Gosta Leonard    ...            0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)    ...            1
9                 Nasser, Mrs. Nicholas (Adele Achem)    ...            1
10                    Sandstrom, Miss. Marguerite Rut    ...            1
11                           Bonnell, Miss. Elizabeth    ...            1
12                     Saundercock, Mr. William Henry    ...            0
13                        Andersson, Mr. Anders Johan    ...            0
14               Vestrom, Miss. Hulda Amanda Adolfina    ...            0
15                   Hewlett, Mrs. (Mary D Kingcome)     ...            1
16                               Rice, Master. Eugene    ...            0
17                       Williams, Mr. Charles Eugene    ...            1
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...    ...            0
19                            Masselmani, Mrs. Fatima    ...            1
20                               Fynney, Mr. Joseph J    ...            0
21                              Beesley, Mr. Lawrence    ...            1
22                        McGowan, Miss. Anna "Annie"    ...            1
23                       Sloper, Mr. William Thompson    ...            1
24                      Palsson, Miss. Torborg Danira    ...            0

[25 rows x 4 columns]

In [41]:
titanic_df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [38]:
titanic_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [43]:
titanic_df_female = titanic_df[titanic_df['Sex'] =='female']

In [44]:
titanic_df_female.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
8            9         1       3    ...     11.1333   NaN         S
9           10         1       2    ...     30.0708   NaN         C

[5 rows x 12 columns]